csalamehInit.org
#+TITLE: Csalameh's Emacs configuration
#+OPTIONS: toc:4 h:4


* Configuration

** Setup emacs home dir
#+begin_src emacs-lisp

(setq default-directory "D:/ToolsAndUtilities/tools/emacs-24/site-lisp")
(setq user-emacs-directory "D:/ToolsAndUtilities/tools/emacs-24/site-lisp")
(setq diary-file "D:/ToolsAndUtilities/tools/emacs-24/site-lisp")

#+end_src

** Setting ENV variable

#+begin_src emacs-lisp
(setq debug-on-error t)
(setq message-log-max t)
(setenv "PATH"
(concat
"D:/ToolsAndUtilities/tools/emacs-24/site-lisp/graphviz/release/bin" ";"
"D:/ToolsAndUtilities/tools/GnuWin32/GetGnuWin32Install/bin" ";"
(getenv "PATH")
)
)
(setenv "GRAPHVIZ_DOT"
(concat
"D:/ToolsAndUtilities/tools/emacs-24/site-lisp/graphviz/release/bin/dot.exe"
)
)
(setenv "DICTIONARY"
(concat
"D:/ToolsAndUtilities/tools/emacs-24/site-lisp/ispell/english.hash"
)
)

#+end_src

** Setting up some variables

#+begin_src emacs-lisp
;; Content of .emacs
(custom-set-variables
;; custom-set-variables was added by Custom.
;; If you edit it by hand, you could mess it up, so be careful.
;; Your init file should contain only one such instance.
;; If there is more than one, they won't work right.
'(case-fold-search t)
'(current-language-environment "Latin-1")
'(default-input-method "latin-1-prefix")
'(eshell-modify-global-environment t)
'(eshell-prefer-lisp-variables t)
'(menu-bar-mode t nil (menu-bar))
;'(org-agenda-files nil)
'(show-paren-mode t nil (paren))
'(tool-bar-mode nil nil (tool-bar))
'(toolbar-visible-p nil))
(custom-set-faces
;; custom-set-faces was added by Custom.
;; If you edit it by hand, you could mess it up, so be careful.
;; Your init file should contain only one such instance.
;; If there is more than one, they won't work right.
)
#+end_src

** Setting up the proxy

#+begin_src emacs-lisp
;; End content of .emacs

;;C:\Users\<username>\AppData\Roaming\.emacs.d\init.el
;;http://ergoemacs.org/emacs/emacs_installing_packages.html
;;http://ergoemacs.org/emacs/emacs_package_system.html
;;http://www.damtp.cam.ac.uk/user/sje30/emacs/ell-date.html
;;Emacs Lisp List - Problem: I see dead people (links). http://www.damtp.cam.ac.uk/user/sje30/emacs/ell.html
;;Emacswiki - Problem: May contain traces of nuts (malicious code). http://www.emacswiki.org/
;;Emacsmirror - The package repository I am working on. Problem: No package manager supports it natively yet. https://github.com/emacsmirror

;;setup proxy
;;(setq url-proxy-services
;;'(("http"     . "proxylb:3128")
;;("no_proxy" . "^.*\\(murex\\)\\.com")))
;; Define packages to be installed on start up.

#+end_src

** Setup the package installer

#+begin_src emacs-lisp
(setq package-user-dir "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/elpa")
(setq package-directory-list
(list (file-name-as-directory package-user-dir)
"D:/ToolsAndUtilities/tools/emacs-24/site-lisp/elpa"))
(require 'package)
(add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/"))
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
(add-to-list 'package-archives '("marmalade" . "http://marmalade-repo.org/packages/"))
(add-to-list 'package-archives '("melpa" . "http://melpa.milkbox.net/packages/"))
(package-initialize)
(when (not package-archive-contents) (package-refresh-contents))


;;date-calc.el - Date calculation and parsing routines.
;;ell.el - Browse the Emacs Lisp List.
;;elm.el, elx.el, xpkg.el - Used to maintain the Emacsmirror.
;;genauto.el - Helps generate autoloads for your elisp packages.
;;inversion.el - Require specific package versions.
;;loadhist.el, lib-requires.el, elisp-depend.el - Commands to list Emacs Lisp library dependencies.
;;project-root.el - Define a project root and take actions based upon it.
;;strptime.el - Partial implementation of POSIX date and time parsing.
;;wikirel.el - Visit relevant pages on the Emacs Wik      
(defvar my-packages '(cl-lib
color-theme
color-theme-solarized
tangotango-theme
bbdb
evil
ggtags
highlight-parentheses
magit
markdown-mode
;;                    org
;;		      org-plus-contrib
markdown-mode+
smex
ox-reveal
undo-tree
auto-complete
auto-complete-pcmp
 flyspell 
yasnippet
;groovy-mode
)
"A list of packages to ensure are installed at launch.")    
(dolist (p my-packages)
(when (not (package-installed-p p))
(package-install p)))
#+end_src

** Setup GUI customization
#+begin_src emacs-lisp

;; specify default browser
(setq browse-url-browser-function 'browse-url-w3)

;; disable vc to prevent hooks by svn
(setq vc-handled-backends nil)

;; display scrollbar
(scroll-bar-mode t)

;; display menu
(menu-bar-mode t)
(tool-bar-mode -1)

;; colortheme tangotango
(require 'tangotango-theme)
(setq ido-enable-flex-matching t) ; fuzzy matching is a must have
(setq ido-everywhere t)
(ido-mode t)
(setq default-frame-alist
'((top . 200) (left . 400)
(width . 80) (height . 40)
(cursor-type . box)
(font . "Consolas-12")))
#+end_src

** Disbale killing Emacs

#+begin_src emacs-lisp

(defun dont-kill-emacs()
"Disable C-x C-c binding execute kill-emacs."
(interactive)
(error (substitute-command-keys "To exit emacs: \\[kill-emacs]")))
(global-set-key (kbd "C-x C-c") 'dont-kill-emacs)
#+end_src

* GTAGS

#+begin_src emacs-lisp :tangle no
#+++++ to be reviewed
(setq gops-mxg2000-depot "D:/SRC_DEPOT/v2000.2.11.build")
(setq gops-mxg327-depot "D:/SRC_DEPOT/v3.1.27/")
(setq gops-mx3-depot "D:/depot/v3.1.build")
;(setq org-remember-templates
;      '(
;	("Todo" ?t "* TODO %? %^g\n %i\n " "D:/Projects/org/agenda/todo.org" "Office")
;        ("Journal" ?j "\n* %^{topic} %T \n%i%?\n" "D:/Projects/org/agenda/journal.org")
;	))
;(global-linum-mode 1)
;(setq column-number-mode t)
;(setq frame-title-format '(buffer-file-name "%f" ("%b")))
;(setq ring-bell-function 'ignore)
;(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
;(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
(setq vc-handled-backends nil)
(setq ahk-syntax-directory "d:/ToolsAndUtilities/tools/AutoHotKey/Extras/Editors/Syntax")
(add-to-list 'auto-mode-alist '("\\.ahk$" . ahk-org-mode))
(autoload 'ahk-org-mode "ahk-org-mode")
#+end_src

* gops.el
#+begin_src emacs-lisp
(custom-set-variables
'(case-fold-search t)
'(current-language-environment "Latin-1")
'(default-input-method "latin-1-prefix")
'(menu-bar-mode t nil (menu-bar))
'(show-paren-mode t nil (paren))
'(tool-bar-mode nil nil (tool-bar))
'(toolbar-visible-p nil))
(fset 'yes-or-no-p 'y-or-n-p)
(setq transient-mark-mode t)
(setq display-time-day-and-date t)
(setq display-time-24hr-format t)
(display-time)
(setq column-number-mode t)
(setq line-number-mode t)
(setq inhibit-startup-message t)
(setq fill-column 130)
;; (kill-whole-line t)
(setq tab-width 4)
(setq hilight-paren-expression t)
(if (fboundp 'global-font-lock-mode)
(global-font-lock-mode 1)
(setq font-lock-auto-fontify t))
(setq font-lock-mode-maximum-decoration t)
#+end_src

#+begin_src emacs-lisp  :tangle no
(setq
load-path
(append
(list
(expand-file-name (concat exec-directory "../../site-lisp/org/lisp"))
(expand-file-name (concat exec-directory "../../site-lisp/color-theme"))
(expand-file-name (concat exec-directory "../../site-lisp"))
(expand-file-name (concat exec-directory   "../../site-lisp/yasnippet"))
) load-path))
#+end_src

#+begin_src emacs-lisp :tangle no
;; Matching parenthesis using % as in Vi.
(defun match-paren (arg)
"Go to the matching parenthesis if on parenthesis otherwise insert %."
(interactive "p")
(cond ((looking-at "\\s\(") (forward-list 1) (backward-char 1))
((looking-at "\\s\)") (forward-char 1) (backward-list 1))
(t (self-insert-command (or arg 1))))) (global-set-key "%" 'match-paren)
(defun dos-unix ()
(interactive)
(goto-char (point-min))
(while (search-forward "\r" nil t) (replace-match "")))
(defun unix-dos ()
(interactive)
(goto-char (point-min))
(while (search-forward "\n" nil t) (replace-match "\r\n")))
(defun indent-buffer ()
(interactive)
(save-excursion
(indent-region (point-min) (point-max) nil))) (global-set-key [f12] 'indent-buffer)
(defun indent-or-complete ()
"Complete if point is at end of a word, otherwise indent line."
(interactive)
(if (looking-at "$")
(hippie-expand nil))
(indent-for-tab-command))
(global-set-key [C-tab] 'dabbrev-expand)
(add-to-list 'auto-mode-alist
(cons (concat "\\." (regexp-opt '("cpp" "cc" "C" "h" "hpp" "hh" "H" "cxx" "hxx") t) "\\'") 'c++-mode))
(add-to-list 'auto-mode-alist
(cons (concat "\\." (regexp-opt '("xml" "xslt" "xsl" "xsd" "rng" "mxres" "html" "xhtml") t) "\\'") 'nxml-mode))
(add-hook 'nxml-mode-hook 'turn-on-auto-fill)
(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))
(require 'gtags)
(defun gops-open-tag-mxg2000 (tag)
(setq gtags-rootdir (expand-file-name gops-mxg2000-depot))
(gtags-goto-tag tag "")
(raise-frame))
(defun gops-open-tag-mx3 (tag)
(setq gtags-rootdir (expand-file-name gops-mx3-depot))
(gtags-goto-tag tag "")
(raise-frame))
(defun gops-grep-mxg2000 (tag)
(let ((pattern tag)
(files "*.[ch] *.java *.mxres *.sh")
(dirname (expand-file-name gops-mxg2000-depot)))
(raise-frame)
(grep-compute-defaults)
(rgrep pattern files dirname)))
(defun gops-grep-mx3 (tag)
(let ((pattern tag)
(files "*.[ch] *.java *.mxres *.sh")
(dirname (expand-file-3name gops-mx3-depot)))
(raise-frame)
(grep-compute-defaults)
(rgrep pattern files dirname)))
#+end_src

#+begin_src emacs-lisp  :tangle no
(require 'color-theme)
(color-theme-initialize)
;; default color-theme
;; (color-theme-sitaramv-nt)
;; org-mode
;; for byte-compilation use emacs -batch -f batch-byte-compile *.el in eshell
(require 'org-install)
(require 'org-mouse)
(setq org-return-follows-link t)
(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)
(setq org-agenda-file-regexp "\\.org\\'")
#+end_src

