csalamehInit.org
* Settings

#+begin_src emacs-lisp :tangle no
;; Settings
(setq org-cycle-separator-lines 1) ;Display blank lines, like outline-blank-lines
(setq org-special-ctrl-a/e t) ;C-a goes to beginning of heading, then line
(setq org-tags-column 72)              ;tags right aligned
(setq org-agenda-align-tags-to-column 120);try to right align tags in agenda
(setq org-agenda-start-on-weekday nil)  ;start on current day
(setq org-hide-leading-stars t)         ;only show one *
(setq org-log-done t)                   ;add CLOSED when complete item
(setq org-startup-folded 'showall)      ;Best default for small files with tables
(setq org-highest-priority 49)
(setq org-lowest-priority 57)
(setq org-default-priority 53)
(setq org-export-with-sub-superscripts nil)
(setq org-export-html-style "<link rel=\"stylesheet\" type=\"text/css\" href=\"http://mxdoc:8080/mxdoc/documents/Operate/operate_it/06740.00000/objects/orgstyle.css\"/>")
(setq org-export-with-section-numbers t)
(setq org-export-headline-levels 4)
(setq org-export-with-toc t)
(setq org-export-author-info nil)
(setq org-export-creator-info nil)
(setq org-export-time-stamp-file nil)
(setq org-export-with-timestamps nil)
;; Fast todo selection allows changing from any task todo state to any other state
;; directly by selecting the appropriate key from the fast todo selection key menu. 
(setq org-use-fast-todo-selection t)
;; Change task state to STARTED when clocking in
(setq org-clock-in-switch-to-state "STARTED")
; clendar week stats with monday
(setq calendar-week-start-day 1)
;; when it's done, it's done
(setq org-agenda-skip-deadline-if-done t)
(setq org-agenda-skip-scheduled-if-done t)
(setq org-agenda-skip-timestamp-if-done t) 
;; I often restart my emacs *and* I often forget to clock out
(setq org-clock-in-resume t)
;; and clean up after me a little
(setq org-clock-out-remove-zero-time-clocks t)
;; did I say I restart my emacs?
'(setq org-clock-persist t)
; log state changes into a drawer (introduced in Orgmode 6.23)
(setq org-log-into-drawer "LOGBOOK")
; log closing TODO items
(setq org-log-done 'time)
#+end_src

#+begin_src emcas-lisp :tangle no
;; Custom keywords
(setq org-todo-keywords
'((sequence "TODO(t)" "STARTED(s!)" "NEXT(n)" "|" "DONE(d!/!)" "CANCELLED(c@/!)")
(sequence "WAITING(w@/!)" "|")
))
(setq org-tag-alist '((:startgroup . nil)
("@OFFICE" . ?O)
("@HOME" . ?H)
("@PHONE" . ?P)
(:endgroup . nil)
(:startgroup . nil)
("URGENT" . ?U)
(:endgroup . nil)
("AA" . ?a)
("JA" . ?b)
("GS" . ?c)
("AB" . ?d)
("MZ" . ?e)
("JS" . ?f)
("EK" . ?g)
("GD" . ?h)
("SC" . ?i)
("GG" . ?j)
("CA" . ?k)
("EA" . ?l)
("NB" . ?m)
("WM" . ?n)
))
(setq org-columns-default-format
"%40ITEM(Details) %14CATEGORY(Catg) %9TODO(To Do) %15SCHEDULED(Sched) %15DEADLINE(Deadline) %20TAGS(Context) %5Effort(Time){:} %6CLOCKSUM(Spent){Total}")
(setq org-global-properties (quote (
("Effort_ALL" . "0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 8:00 10:00 12:00")
("CATEGORY_ALL" . "ProdSupport ConsultSupport OtherSupport QaSupport Support Projects Absence Other"))))

(setq org-agenda-time-grid 
'((weekly require-timed) "--------------------"
(700 800 1000 1200 1400 1600 1800 2000 2200 2400)))

(require 'org-publish)
(setq org-publish-project-alist
'(("org"
:components ("org-docs" "org-static"))
("org-docs"
:base-directory "."
:base-extension "org"
:publishing-directory ".."
:recursive t		 
:publishing-function org-publish-org-to-html
:headline-levels 4             ; Just the default for this project.
:auto-preamble t
)
("org-static"
:base-directory "."
:base-extension "png\\|jpg\\|gif\\|sh\\|xml\\|zip\\|pdf"
:publishing-directory "../../objects/"
:recursive t
:publishing-function org-publish-attachment
)
))

(defvar my/org-lisp-directory (expand-file-name (concat exec-directory "../../site-lisp/org/lisp"))
"Directory where your org-mode files live.")

(defvar my/org-compile-sources t
"If `nil', never compile org-sources. `my/compile-org' will only create
the autoloads file `org-install.el' then. If `t', compile the sources, too.")

;; Customize:
(setq my/org-lisp-directory (expand-file-name (concat exec-directory "../../site-lisp/org/lisp")))

;; Customize:
(setq  my/org-compile-sources t)

(defun my/compile-org(&optional directory)
"Compile all *.el files that come with org-mode."
(interactive)
(setq directory (concat
(file-truename
(or directory my/org-lisp-directory)) "/"))

(add-to-list 'load-path directory)

(let ((list-of-org-files (file-expand-wildcards (concat directory "*.el"))))

;; create the org-install file
(require 'autoload)
(setq esf/org-install-file (concat directory "org-install.el"))
(find-file esf/org-install-file)
(erase-buffer)
(mapc (lambda (x)
(generate-file-autoloads x))
list-of-org-files)
(insert "\n(provide (quote org-install))\n")
(save-buffer)
(kill-buffer)
(byte-compile-file esf/org-install-file t)

(dolist (f list-of-org-files)
(if (file-exists-p (concat f "c")) ; delete compiled files
(delete-file (concat f "c")))
(if my/org-compile-sources     ; Compile, if `my/org-compile-sources' is t
(byte-compile-file f)))))
#+end_src

#+begin_src emcas-lisp 
;; gtags mode enabled (for mouse gesture proper handling)
(setq c-mode-hook
'(lambda () (gtags-mode 1)))
(setq c++-mode-hook
'(lambda () (gtags-mode 1)))
(setq java-mode-hook
'(lambda () (gtags-mode 1)))
(setq gtags-select-mode-hook
'(lambda ()
(setq hl-line-face 'underline)
(hl-line-mode 1)))

(fset 'xml-mode 'nxml-mode)
(defun nxml-pretty-print-region (begin end)
"Pretty format XML markup in region. You need to have nxml-mode
http://www.emacswiki.org/cgi-bin/wiki/NxmlMode installed to do
this.  The function inserts linebreaks to separate tags that have
nothing but whitespace between them.  It then indents the markup
by using nxml's indentation rules."
(interactive "r")
(save-excursion
(nxml-mode)
(goto-char begin)
(while (search-forward-regexp "\>[ \\t]*\<" nil t) 
(backward-char) (insert "\n"))
(indent-region begin end))
(message "Ah, much better!"))
(setq htmlize-output-type "css")
(setq org-export-htmlize-output-type 'css)
(ido-mode t)
(setq ido-enable-flex-matching t) ; fuzzy matching is a must have
(setq org-completion-use-ido t) ; enable ido for org-mode too 
(org-remember-insinuate)
(add-hook 'ido-setup-hook 
(lambda () 
(define-key ido-completion-map [tab] 'ido-complete)))
;; The following adds an extra keybinding to interactive search (C-s) that runs occur on the current search string/regexp,
;; immediately showing all hits in the entire buffer.
(define-key isearch-mode-map (kbd "C-o")
(lambda ()
(interactive)
(let ((case-fold-search isearch-case-fold-search))
(occur (if isearch-regexp isearch-string
(regexp-quote isearch-string))))))
(global-set-key (kbd "C-x C-b") 'ibuffer)

(defadvice remember-finalize (after delete-remember-frame activate)
"Advise remember-finalize to close the frame if it is the remember frame"
(if (equal "remember" (frame-parameter nil 'name))
(delete-frame)))

(defadvice remember-destroy (after delete-remember-frame activate)
"Advise remember-destroy to close the frame if it is the rememeber frame"
(if (equal "remember" (frame-parameter nil 'name))
(delete-frame)))

;; make the frame contain a single window. by default org-remember
;; splits the window.
(add-hook 'remember-mode-hook
'delete-other-windows)

(defun make-remember-frame ()
"Create a new frame and run org-remember."
(interactive)
(make-frame '((name . "remember") (width . 80) (height . 20)))
(select-frame-by-name "remember")
(org-remember))

(defun gops-org-open-ticket (ticketid)
(let ((org-link-frame-setup
'((vm . vm-visit-folder)
(gnus . gnus)
(file . find-file))))
(raise-frame)
(org-open-link-from-string (concat "file://" gops-org-actions-location "/" ticketid ".org"))))

(defun gops-org-open-from-imfo (ticketid)
(let ((org-link-frame-setup
'((vm . vm-visit-folder)
(gnus . gnus)
(file . find-file))))
(raise-frame)
(org-open-link-from-string (concat "file://" ticketid))))

(defun gops-org-open-transfer-at-location (ticketid)
(let ((org-link-frame-setup
'((vm . vm-visit-folder)
(gnus . gnus)
(file . find-file))))
(raise-frame)
(org-open-link-from-string (concat "file://" gops-org-actions-location "/transfer.org::*" ticketid))))

(defun make-diff-frame (file-A file-B)
"Create a new frame and run diff."
(interactive)
(make-frame '((name . "differences") (width . 160) (height . 60)))
(select-frame-by-name "differences")
(raise-frame)
(ediff-files (expand-file-name file-A) (expand-file-name file-B)))

;; ediff customization
(setq ediff-window-setup-function 'ediff-setup-windows-plain)
(setq ediff-split-window-function 'split-window-horizontally)
#+end_src0

#+begin_src emcas-lisp :tangle no
;; yasnippets
(require 'yasnippet) ;; not yasnippet-bundle
(yas/initialize)
(yas/load-directory (expand-file-name (concat exec-directory "../../site-lisp/yasnippet/snippets")))
(add-hook 'org-mode-hook
(lambda ()
;; yasnippet
(make-variable-buffer-local 'yas/trigger-key)
(setq yas/trigger-key [tab])
(define-key yas/keymap [tab] 'yas/next-field-group)))
(defun eshell/op (FILE)
"Invoke (w32-shell-execute \"Open\" FILE) and substitute slashes for backslashes"
(w32-shell-execute "Open" (substitute ?\\ ?/ (expand-file-name FILE)))) 

(setq org-export-html-style "<link rel=\"stylesheet\" type=\"text/css\" href=\"http://mxdoc:8080/mxdoc/documents/Operate/operate_it/06740.00000/objects/orgstyle.css\"/>")
#+end_src

** Transparency
#+begin_src emcas-lisp
;; fancy transparency
(defun djcb-opacity-modify (&optional dec)
"modify the transparency of the emacs frame; if DEC is t,
decrease the transparency, otherwise increase it in 10%-steps"
(let* ((alpha-or-nil (frame-parameter nil 'alpha)) ; nil before setting
(oldalpha (if alpha-or-nil alpha-or-nil 100))
(newalpha (if dec (- oldalpha 5) (+ oldalpha 5))))
(when (and (>= newalpha frame-alpha-lower-limit) (<= newalpha 100))
(modify-frame-parameters nil (list (cons 'alpha newalpha))))))

;; C-8 will increase opacity (== decrease transparency)
;; C-9 will decrease opacity (== increase transparency
;; C-0 will returns the state to normal
(global-set-key (kbd "C-8") '(lambda()(interactive)(djcb-opacity-modify)))
(global-set-key (kbd "C-9") '(lambda()(interactive)(djcb-opacity-modify t)))
(global-set-key (kbd "C-0") '(lambda()(interactive)(modify-frame-parameters nil `((alpha . 100)))))
(load (concat exec-directory "../../site-lisp/sandbox.el"))
#+end_src

** Auto byte compilation on save

#+begin_src emcas-lisp :tangle no
(defun auto-byte-recompile ()
"If the current buffer is in emacs-lisp-mode and there already exists an `.elc'
file corresponding to the current buffer file, then recompile the file."
(interactive)
(when (and (eq major-mode 'emacs-lisp-mode)
(file-exists-p (byte-compile-dest-file buffer-file-name)))
(byte-compile-file buffer-file-name)))
(add-hook 'after-save-hook 'auto-byte-recompile)
#+end_src

** Unset key bindings

#+begin_src emcas-lisp :tangle no
http://ergoemacs.org/emacs/keyboard_shortcuts.html
FIX http://lists.gnu.org/archive/html/emacs-orgmode/2010-04/msg00355.html F5

;; unset a key
(global-unset-key (kbd "C-b"))
;; or
(global-set-key (kbd "C-b") nil)
#+end_src

* Orgmode configuration

Moved to org-mode.el  


#+begin_src emacs-lisp 

;; ==============================================
;;;Loading orgmode
;;; Org Mode
;(add-to-list 'load-path (expand-file-name "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org-mode/lisp"))
(add-to-list 'load-path "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org-plus-contrib" t)
(add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\|txt\\)$" . org-mode))
(require 'org)

(let ((base "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org"))

(add-to-list 'load-path base)
(dolist (f (directory-files base))
(let ((name (concat base "/" f)))
(when (and (file-directory-p name) 
(not (equal f ".."))
(not (equal f ".")))
(add-to-list 'load-path name)))))

#+end_src

*** Configuration of org-oxreveal

#+begin_src emacs-lisp  :tangle no
;; Loading or reveal for presentation generation	   
(load "ox-reveal.el")
(live-load-config-file "ox-reveal.el")
(setq org-reveal-root "file:///D:/ToolsAndUtilities/tools/emacs-24/javascript/reveal.js")
(setq org-reveal-root "http://cypher:8090/svn/PAR/PFR/0000030/GOPS/Operate-IT/InternalOngoingProjects/COS_IOS_IT/reveal.js")
;; http://cdn.jsdelivr.net/reveal.js/2.5.0/
;; ==============================================


#+end_src

