csalamehInit.el
;;;Loading orgmode
;;; Org Mode
;(add-to-list 'load-path (expand-file-name "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org-mode/lisp"))
(add-to-list 'load-path "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org-plus-contrib" t)
(add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\|txt\\)$" . org-mode))
(require 'org)

(let ((base "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org"))

(add-to-list 'load-path base)
(dolist (f (directory-files base))
(let ((name (concat base "/" f)))
(when (and (file-directory-p name) 
(not (equal f ".."))
(not (equal f ".")))
(add-to-list 'load-path name)))))

;; ediff customization
(setq ediff-window-setup-function 'ediff-setup-windows-plain)
(setq ediff-split-window-function 'split-window-horizontally)

;; yasnippets
;;(require 'yasnippet) ;; not yasnippet-bundle
;;(yas/initialize)
;;(yas/load-directory (expand-file-name (concat exec-directory "d:/ToolsAndUtilities/tools/emacs-24/site-lisp/yasnippet/snippets")))
