csalamehInit.org
*** Ediff config   

#+begin_src emacs-lisp
;; ediff customization
(setq ediff-window-setup-function 'ediff-setup-windows-plain)
(setq ediff-split-window-function 'split-window-horizontally)

;; yasnippets
;;(require 'yasnippet) ;; not yasnippet-bundle
;;(yas/initialize)
;;(yas/load-directory (expand-file-name (concat exec-directory "d:/ToolsAndUtilities/tools/emacs-24/site-lisp/yasnippet/snippets")))
;(defun yas/org-very-safe-expand ()
; (let ((yas/fallback-behavior 'return-nil)) (yas/expand)))

;;(add-hook 'org-mode-hook
;;         (lambda ()
;;          ;; yasnippet (using the new org-cycle hooks)
;;         (make-variable-buffer-local 'yas/trigger-key)
;;        (setq yas/trigger-key [tab])
;;       (add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
;;      (define-key yas/keymap [tab] 'yas/next-field)))

(defun eshell/op (FILE)
"Invoke (w32-shell-execute \"Open\" FILE) and substitute slashes for backslashes"
(w32-shell-execute "Open" (substitute ?\\ ?/ (expand-file-name FILE)))) 

;; fancy transparency
(defun djcb-opacity-modify (&optional dec)
"modify the transparency of the emacs frame; if DEC is t,
decrease the transparency, otherwise increase it in 10%-steps"
(let* ((alpha-or-nil (frame-parameter nil 'alpha)) ; nil before setting
(oldalpha (if alpha-or-nil alpha-or-nil 100))
(newalpha (if dec (- oldalpha 5) (+ oldalpha 5))))
(when (and (>= newalpha frame-alpha-lower-limit) (<= newalpha 100))
(modify-frame-parameters nil (list (cons 'alpha newalpha))))))

;; C-8 will increase opacity (== decrease transparency)
;; C-9 will decrease opacity (== increase transparency
;; C-0 will returns the state to normal
(global-set-key (kbd "C-8") '(lambda()(interactive)(djcb-opacity-modify)))
(global-set-key (kbd "C-9") '(lambda()(interactive)(djcb-opacity-modify t)))
(global-set-key (kbd "C-0") '(lambda()(interactive)(modify-frame-parameters nil `((alpha . 100)))))
;;(load (concat exec-directory "sandbox.el"))

#+end_src

#+begin_src emacs-lisp  :tangle no

;; (setq org-agenda-files (list "D:/depot/operate-shifts/Calendar" "D:/depot/operate-shifts/Actions"))
(setq
default-frame-alist 
(append
(list
'(height . 50) ;; default height
'(width . 150) ;; default width
'(font . "Lucida Console-9") ;; font name and size
'(alpha . 100) ;; transparency, if 100 fully opaque, < 100 transparent
)
default-frame-alist))
;; line display
;;(require 'color-theme-tango)
;;(color-theme-tango)
;;(require 'zenburn)
;;(color-theme-zenburn)
(setq org-agenda-files (list "D:/depot/operate-shifts/Calendar"))
(setq org-archive-location "d:/depot/operate-shifts/org_archive/%s::")
(setq gops-org-actions-location "D:/depot/operate-shifts/Actions")
#+end_src

*** Load Org-mode config
#+begin_src emacs-lisp
(setq org-user-agenda-files (quote ("D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org"
                               "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org/clients"
                               "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org/agenda"
                                 )))

(org-babel-load-file (expand-file-name "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org-mode.org"))


#+end_src   
