csalamehInit.el
;(defun yas/org-very-safe-expand ()
; (let ((yas/fallback-behavior 'return-nil)) (yas/expand)))

;;(add-hook 'org-mode-hook
;;         (lambda ()
;;          ;; yasnippet (using the new org-cycle hooks)
;;         (make-variable-buffer-local 'yas/trigger-key)
;;        (setq yas/trigger-key [tab])
;;       (add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
;;      (define-key yas/keymap [tab] 'yas/next-field)))

(defun eshell/op (FILE)
"Invoke (w32-shell-execute \"Open\" FILE) and substitute slashes for backslashes"
(w32-shell-execute "Open" (substitute ?\\ ?/ (expand-file-name FILE)))) 

;; fancy transparency
(defun djcb-opacity-modify (&optional dec)
"modify the transparency of the emacs frame; if DEC is t,
decrease the transparency, otherwise increase it in 10%-steps"
(let* ((alpha-or-nil (frame-parameter nil 'alpha)) ; nil before setting
(oldalpha (if alpha-or-nil alpha-or-nil 100))
(newalpha (if dec (- oldalpha 5) (+ oldalpha 5))))
(when (and (>= newalpha frame-alpha-lower-limit) (<= newalpha 100))
(modify-frame-parameters nil (list (cons 'alpha newalpha))))))

;; C-8 will increase opacity (== decrease transparency)
;; C-9 will decrease opacity (== increase transparency
;; C-0 will returns the state to normal
(global-set-key (kbd "C-8") '(lambda()(interactive)(djcb-opacity-modify)))
(global-set-key (kbd "C-9") '(lambda()(interactive)(djcb-opacity-modify t)))
(global-set-key (kbd "C-0") '(lambda()(interactive)(modify-frame-parameters nil `((alpha . 100)))))
;;(load (concat exec-directory "sandbox.el"))

(setq org-user-agenda-files (quote ("D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org"
                               "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org/clients"
                               "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org/agenda"
                                 )))

(org-babel-load-file (expand-file-name "D:/ToolsAndUtilities/tools/emacs-24/site-lisp/org-mode.org"))
